/* Flubber Panel: Label on the button to cancel the subscription to the newsletter */
"Cancel" = "Annulla";
/* Flubber Panel: Placeholder text for the email field */
"Email Address" = "Indirizzo Email";
/* Flubber Panel: Message for the alert to subscribe to the newsletter */
"Enter your email address to subscribe to our mailing list." = "Inserisci il tuo indirizzo email per ricevere news e aggiornamenti sulle nostre applicazioni.";
/* Flubber Panel: Label for section with social links */
"Follow us" = "Seguici";
/* Flubber Panel: Label on button to dismiss the \"no connection\" alert
   Flubber Panel: Label on the button to dismiss the alert displayed when the signup fails */
"OK" = "OK";
/* Flubber Panel: Label for section with other apps */
"Our Apps" = "Colleziona le nostre App";
/* Flubber Panel: Label on the button to subscribe to the newsletter
   Flubber Panel: Title for the alert to subscribe to the newsletter */
"Subscribe" = "Iscriviti";
/* Flubber Panel: Title for the alert displayed when the signup fails */
"Subscription Failed" = "Iscrizione fallita";
/* Flubber Panel: Label for section with support email
   Flubber Panel: Prefix used for the subject of support emails */
"Support" = "Supporto";
/* Flubber Panel: Message for the alert displayed when the signup fails */
"We couldn't subscribe you to the list. Please check your email address and try again." = "Si è verificato un errore. Controlla l'indirizzo email inserito e prova di nuovo.";
/* Flubber Panel: Message when user taps on an App but is not connected to Internet */
"You need an Internet connection to download this App" = "Errore di connessione. È necessaria una connessione internet per scaricare questa App";
